export const RegExps = {
  /**
   * 1-999的正整数
   */
  PositiveInteger3: /^\+?[1-9]{1}[0-9]{0,2}\d{0,0}$/,
  /**
 * 大于等于0的整数
 */
  PositiveInteger1: /^\+?[0-9]\d*$/,


  /**
  * 四位数整数
  */
  PositiveInteger4: /^([0-9]{1,4}|100)$/,
  /**
   * 五位数整数
   */
  PositiveInteger5: /^([0-9]{1,5}|100)$/,
  /**
   * 六位数整数
   */
  PositiveInteger6: /^([0-9]{1,6}|100)$/,
  /**
   * 七位数整数
   */
  PositiveInteger7: /^([0-9]{1,7}|100)$/,
  /**
 * 正数，保留1位小数
 */
  PositiveNumberFix1: /^(0|[1-9]\d*)(\s|$|\.\d{1,1}\b)/,
  /**
   * 正数，保留2位小数
   */
  PositiveNumberFix2: /^(0|[1-9]\d*)(\s|$|\.\d{1,2}\b)/,
  /**
   * 正数，保留3位小数
   */
   PositiveNumberFix3: /^(0|[1-9]\d*)(\s|$|\.\d{1,3}\b)/,
  /**
   * 正数，保留4位小数
   */
  PositiveNumberFix4: /^(0|[1-9]\d*)(\s|$|\.\d{1,4}\b)/,
    /**
   * 可输入最多4位小数的正数、负数、和小数
   */
    AllNumber4: /^([\+ \-]?(([1-9]\d*)|(0)))([.]\d{1,4})?$/,
  /**
   * 正数，保留5位小数
   */
  PositiveNumberFix5: /^(0|[1-9]\d*)(\s|$|\.\d{1,5}\b)/,
  /**
   * 大于0的数字且最多保留2位小数
   */
  APositiveNumberFix2: /(^[1-9](\d+)?(\.\d{1,2})?$)|(^\d\.\d{1,2}$)/,

  /**
 * 大于0的数字且最多保留3位小数
 */
  APositiveNumberFix3: /(^[1-9](\d+)?(\.\d{1,3})?$)|(^\d\.\d{1,3}$)/,

  /**
   * 整数
   */
  IntNumber: /^-?[0-9]\d*$/,
    /**
   * 大于0整数
   */
  IntNumber2: /^-?[1-9]\d*$/,
  /**
   * 非法字符限制
   */
  LimitCharacter: /[@#\$%\^&\*]+/g,
  /**
   * 只能输入汉字、字母（大小写）、数字
   */
  Forbidcharacter: /^((?!@|#|\$|%|\^|&|\*).)*$/,// /^[\u4E00-\u9FA5A-Za-z0-9]+$/,
  //判断身份证
  IdCardNumberType: /^[1-9]\d{5}(18|19|([23]\d))\d{2}((0[1-9])|(10|11|12))(([0-2][1-9])|10|20|30|31)\d{3}[0-9Xx]$/,
  /**
   * 只能输入字母（大写）、数字
   */
  CharacterUpperAndNumber: /^[A-Z0-9]+$/,

  // 正则判断手机号码
  PhoneJudge: /^[1][3,4,5,7,8,9][0-9]{9}$/,
  /**
   * 只能输入大写字母
  */
  CharacterUpper: /^[A-Z]{2}$/,
  /**
   * 日期格式（YYYY-MM-DD或YYYY/MM/DD）
   */
  Forbiddate: /^(\d{1,4})(-|\/)(\d{1,2})\2(\d{1,2})$/,
  /** 去掉首尾，(英文逗号) */
  TrimComma: /^(\s|，)+|(\s|,)+$/g,
  /** 去掉首尾空格 */
  TrimSpace: /^\s+|\s+$/g,
  /**
   * 可输入最多两位小数的正数、负数、和小数
   */
  AllNumber: /^([\+ \-]?(([1-9]\d*)|(0)))([.]\d{1,2})?$/,
  /** 限制25个，数字字母下划线 */
  LimitLength25: /^[a-zA-Z0-9_]{1,25}$/,
};
