export enum AppIdEnum {
    /** 鸡照蛋落盘 */
    zqeggtestertray = '2203041815020000109',
    /** 鸡出雏捡苗 */
    zqpickupchick = '2203081725370000109',
    /** 孵化批次 */
    zqhatchbatch = '2202280934400000109',



    

    /** 类型设置 */
    typeSetting = '2005201606570000101',
    /** 栋舍设置 */
    houseSetting = '2005201430130000101',
    /** 公猪喂养 */
    boarFeed = '2006091006590000101',
    /** 公猪采精 */
    boarSemen = '2006091002440000101',
    /** 公猪转舍 */
    boarTurn = '2005301827300000101',
    /** 公猪淘汰 */
    boarKnockOut = '2006221455590000101',
    /** 公猪死亡 */
    boarDeath = '2006221452560000101',
    /** 公猪档案 */
    boarFile = '2005292225300001301',
    /** 后备转公猪 */
    reserveturnBoar = '2006011027340000101',
    /** 公猪批次设置 */
    boarBatchSetting = '2005292227570001001',
    /** 公猪调拨 */
    boarAllocation = '2007031711310000101',
    /** 发情记录 */
    ruttingRecord = '2005251403450000101',
    /** 母猪配种 */
    sowBreeding = '2005201638050000101',
    /** 后备配种 */
    hbSowBreeding = '2005201644240000101',
    /** 妊检记录 */
    mateCheck = '2005201622030000101',
    /** 分娩记录 */
    sowBirth = '2005201633430000101',
    /** 断奶记录 */
    sowWeaning = '2005201634500000101',
    /** 母猪寄养 */
    sowFfosterCare = '2006051302010000101',
    /** 背膘测定 */
    backDetermination = '2005301825560000101',
    /** 母猪转舍 */
    sowTurn = '2005201636320000101',
    /** 母猪淘汰 */
    sowKnockout = '2005201618110000101',
    /** 母猪死亡 */
    sowDeath = '2005201616300000101',
    /** 母猪喂养 */
    sowFeed = '2006051520470000101',
    /** 母猪档案 */
    sowFile = '2005201346240000101',
    /** 后备转母猪 */
    reserveturnSow = '2005251406390000101',
    /** 母猪历史 */
    sowHistory = '2005201639440000101',
    /** 母猪批次 */
    sowBatchSetting = '2005201641300000101',
    /** 母猪调拨 */
    sowAllocation = '2007031709140000101',
    /** 肥猪转舍 */
    fatTurn = '2006120957080000101',
    /** 肥猪死亡 */
    fatDeath = '2006011031430000101',
    /** 肥猪喂养 */
    fatFeed = '2006191015420000101',
    /** 肥猪盘点 */
    fatInventory = '2006051303340000101',
    /** 肥猪批次 */
    fatBatchSetting = '2005292223180001701',
    /** 肥猪调拨 */
    fatAllocation = '2007031713490000101',
    /** 免疫记录 */
    immunityRecord = '2006191020160000101',
    /** 猪只销售 */
    sowSell = '2007092157330000101',
    /** 猪只采购 */
    pigPurchasing = '2007092156450000101',
    /** 提示汇总 */
    promptSummary = '2006151658380000101',
    /** 待配提示 */
    withPrompt = '2006061500100000101',
    /** 分娩提示 */
    birthPrompt = '2006101028120000101',
    /** 断奶提示 */
    weaningPrompt = '2006101029150000101',
    /** 首次妊检提示 */
    firstPregnancyPrompt = '2006101026470000101',
    /** 二次妊检提示 */
    secondPregnancyPrompt = '2006101027380000101',
    /** 母猪淘汰提示 */
    sowKnockoutPrompt = '2006101038500000101',
    /** 上产床提示 */
    uppercotPrompt = '2006101029560000101',
    /** 母猪档案详情 */
    sowInfo = '2005201346240000101',
    /** 部门设置 */
    department = '1710022144390000101',
    /** 商品代号 */
    product = '1708231814060000101',
    /** 单位选项设置 */
    ent = '1709141449290000101',
    /** 仓库设置 */
    warehouse = '1611181343270000101',
    /** 供应商档案 */
    provider = '1612121117460000101',
    /** 员工档案 */
    staff = '1611221534010000101',
    /** 引入人员 */
    person = '1709261010180000101',
    /** 权限分配 */
    auth = '1709261010180000101',
    /** 猪场分配 */
    farm = '1911130941580000101',
    /** 猪场设置 */
    farmset = '2005201609450000101',
    /** 栋舍设置 */
    pighouse = '2005201430130000101',
    /** 公猪档案 */
    boar = '2005292225300001301',
    /** 母猪档案 */
    sow = '2005201346240000101',
    /** 公猪期初 */
    boarinitial='2005251401340000101',
    /** 母猪期初 */
    sowinitial='2005201612210000101',
    /** 肥猪期初 */
    fatinitial='2005201614180000101',
     /** 母猪历史记录 */
     history='2005201639440000101',
      /** 妊检计划 */
     sowPregnancyPlan='2006121729020000101',
     /** 分娩计划 */
     sowBirthPlan='2006051304490000101',
      /** 断奶计划 */
     sowWeaningPlan='2006111440460000101',
    /** 配种计划 */
    breedingPlan='2006111441220000101',
     /** 产仔警告 */
    birthWarning='2011251510010000101',
     /** 配种警告 */
     breedingWarning='2011251508450000101',
      /** 断奶警告 */
    weaningWarning='2011251501200000101',
     /** 收款单 */
     receipt='1611231950150000101',
    //付款单
    FUKUAN='1612011058280000101',
    FUKUANSQ='1612091318520000101',
    /** 猪场首页 */
    homePage='2006220939110000101',
    /** 存栏汇总 */
    inventorySummary='2007301628040000101',
    /** 成本变动汇总 */
    CostChangeSummary='1710191425220000107',
    /** 繁殖力计划*/
    BreedPlan='2008210904570000101',
    /** 产房分析*/
    DeliveryRoomAnalysis='1710191326310000107',
    /** 消毒记录*/
    MSHealth='1803081447060000101',
    /** 公猪性能分析*/
    BoarSemenCollection='1710191338500000107',
    /** 防治记录*/
    preventionRecord='2006191023490000101',
    /** 保健记录*/
    healthcareRecord='2006180948580000101',
    /** PSY红绿灯*/
    PSYIndex='2108301723020000109',
  
    /** 生产管理*/
    shengchanguanli='2104260942050000109',
    /** AI巡检预警*/
    aiyujing='2104260943050000109',
    /** 精准饲喂*/
    jingzhunsiwei='2104260943360000109',
    /** 智能环控*/
    zhinenghuankong='2104260945490000109',
    /** 智能能耗*/
    zhinengnenghao='2104261005230000109',
    /** 远程卖猪*/
    yuanchengmaizhu='2104260949280000109',
    /** 洗消监管*/
    xixiaoguanli='2104260947090000109',
    /** 疫病监管*/
    yibingjianguan='2104260950240000109',
    /** 远程风控*/
    yuanchengfengkong='2104261003030000109',
    /** 智能环保*/
    zhinenghuanbao='2104260954070000109',
    /** 智能盘估*/
    zhinengpangu='2104260946160000109',
    /** 代养管理*/
    daiyangguanli='2104261003510000109',	
}
